In [3]:
import pandas as pd

In [4]:
#import pandas
import pandas as pd

In [5]:
#load date
budgetdf = pd.read_csv("budget.csv")

In [6]:
budgetdf.head(10)

       Date  Profit/Losses
0  Jan-2010         867884
1  Feb-2010         984655
2  Mar-2010         322013
3  Apr-2010         -69417
4  May-2010         310503
5  Jun-2010         522857
6  Jul-2010        1033096
7  Aug-2010         604885
8  Sep-2010        -216386
9  Oct-2010         477532

In [7]:
#check data type
budgetdf.dtypes

Date             object
Profit/Losses     int64
dtype: object

In [8]:
budgetdf = pd.read_csv("budget.csv", parse_dates=["Date"])
budgetdf["Date"] = budgetdf["Date"].dt.to_period(freq = "M")
budgetdf.head(10)

      Date  Profit/Losses
0  2010-01         867884
1  2010-02         984655
2  2010-03         322013
3  2010-04         -69417
4  2010-05         310503
5  2010-06         522857
6  2010-07        1033096
7  2010-08         604885
8  2010-09        -216386
9  2010-10         477532

In [9]:
#check data type
budgetdf.dtypes

Date             period[M]
Profit/Losses        int64
dtype: object

In [10]:
#aggregate sales
budgetdf = budgetdf.groupby(by=["Date"]).sum()

In [11]:
budgetdf

         Profit/Losses
Date
2010-01         867884
2010-02         984655
2010-03         322013
2010-04         -69417
2010-05         310503
...                ...
2016-10         102685
2016-11         795914
2016-12          60988
2017-01         138230
2017-02         671099

[86 rows x 1 columns]

In [12]:
#summary stats
budgetdf.describe()

       Profit/Losses
count   8.600000e+01
mean    4.463090e+05
std     5.363579e+05
min    -1.196225e+06
25%     1.821620e+05
50%     5.703280e+05
75%     7.952262e+05
max     1.170593e+06

In [50]:
#finding how many months
budgetdf.shape

(86, 2)

In [52]:
#getting the average
budgetdf.mean()

Profit/Losses    446309.046512
shift1           443664.458824
dtype: float64

In [53]:
#getting the sum
budgetdf.sum()

Profit/Losses    38382578.0
shift1           37711479.0
dtype: float64

In [55]:
#creating net change
budgetdf["shift1"] = budgetdf["Profit/Losses"].shift(1)
budgetdf.head()

         Profit/Losses    shift1
Date
2010-01         867884       NaN
2010-02         984655  867884.0
2010-03         322013  984655.0
2010-04         -69417  322013.0
2010-05         310503  -69417.0

In [101]:
#calculate net change
budgetdf["netchange"] = budgetdf["Profit/Losses"] - budgetdf["shift1"]
budgetdf.head()

         Profit/Losses    shift1  netchange
Date
2010-01         867884       NaN        NaN
2010-02         984655  867884.0   116771.0
2010-03         322013  984655.0  -662642.0
2010-04         -69417  322013.0  -391430.0
2010-05         310503  -69417.0   379920.0

In [89]:
#average of net change
budgetdf["netchange"].mean()

-2315.1176470588234

In [90]:
#get the max of net change
budgetdf["netchange"].max()

1926159.0

In [91]:
#getting the date/index of greatest increase
budgetdf.netchange[budgetdf.netchange == budgetdf["netchange"].max()].index.tolist()

[Period('2012-02', 'M')]

In [92]:
budgetdf.tail()

         Profit/Losses    shift1  netchange
Date
2016-10         102685  768450.0  -665765.0
2016-11         795914  102685.0   693229.0
2016-12          60988  795914.0  -734926.0
2017-01         138230   60988.0    77242.0
2017-02         671099  138230.0   532869.0

In [93]:
# get the greatest decrease
budgetdf["netchange"].min()

-2196167.0

In [94]:
#getting the date/index of the greatest decrease
budgetdf.netchange[budgetdf.netchange == budgetdf["netchange"].min()].index.tolist()

[Period('2013-09', 'M')]

In [125]:
# create sales summary into a text file
with open("Financial Analysis","w") as file:
    file.write("Financial Analysis")
    file.write("\n")
    file.write("***************************")
    file.write("\n")
    file.write(f"Total Months: {budgetdf.shape[0]}")
    file.write("\n")
    file.write(f"Total Sales: ${round(budgetdf.sum(),2)}")
    file.write("\n")
    file.write(f"Average net change: ${round(budgetdf["netchange"].mean(),2)}") 
    file.write("\n")
    file.write(f"Greatest increase in profits : ${round(budgetdf.netchange[budgetdf.netchange == budgetdf["netchange"].max()].index.tolist(),2)}")
    file.write("\n")
    file.write(f"Greatest decrease in profits : ${round(budgetdf.netchange[budgetdf.netchange == budgetdf["netchange"].min()].index.tolist(),2)}")

SyntaxError: invalid syntax (<ipython-input-125-e5819de2e03e>, line 11)